TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_НормативнаяСертификацияНоменклатуры/гкс_НормативнаяСертификацияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_НормативнаяСертификацияНоменклатуры</name>
  <registerRecords>InformationRegister.гкс_РезультатыНормативнойСертификацииНоменклатуры</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГОСТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НазначениеИспользованияКачества</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидПеревозки</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Анализы</name>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксЗначениеПоказателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательАнализа</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Базис</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтклонятьКачество</name>
      <comment>При отклонении от нормы - отклонять качество</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИскатьВнешниеПробы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_КодыПоказателейКачестваЛИМС/гкс_КодыПоказателейКачестваЛИМС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_КодыПоказателейКачестваЛИМС</name>
  <resources>
    <name>КодЛИМС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Весы</name>
    <type>
      <types>CatalogRef.гкс_ОборудованиеПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_НормативнаяСертификацияНоменклатуры/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
		
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьДанныеСопоставленияЛИМС();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАнализы

&НаКлиенте
Процедура АнализыПоказательАнализаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Анализы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	АнализыПоказательАнализаПриИзмененииНаСервере();
	УстановитьВидимостьДекорацииОтсутствияСопоставленияЛИМС();
	
КонецПроцедуры

&НаКлиенте
Процедура АнализыПриАктивизацииСтроки(Элемент)
	
	УстановитьВидимостьДекорацииОтсутствияСопоставленияЛИМС();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	гкс_ОбщегоНазначенияПЛККлиент.ПровестиИЗакрыть(ЭтотОбъект, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	гкс_ОбщегоНазначенияПЛККлиент.Провести(ЭтотОбъект, Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АнализыПоказательАнализаПриИзмененииНаСервере()
	
	ТекущиеДанные = Объект.Анализы.НайтиПоИдентификатору(Элементы.Анализы.ТекущаяСтрока);
	
	ДанныеПоказателя = ПараметрыПоказателя(ТекущиеДанные.ПоказательАнализа);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеПоказателя);
	
	ОбновитьДанныеСопоставленияЛИМС(ТекущиеДанные.ПоказательАнализа);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПоказателя(Показатель)

	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ЕдиницаИзмерения", "ЕдиницаИзмерения");
	Реквизиты.Вставить("ОтклонятьКачество", "гкс_ПриОтклоненииОтНормыОтклонятьКачество");
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Показатель, Реквизиты);
	
КонецФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ОбновитьДанныеСопоставленияЛИМС(Показатель = Неопределено)
	
	МенеджерРегистра = РегистрыСведений.гкс_КодыПоказателейКачестваЛИМС;
	
	ПараметрыСопоставления = МенеджерРегистра.ИнициализироватьПараметрыСопоставленияПоказателей();
	ПараметрыСопоставления.ТочкаМаршрута = Объект.ТочкаМаршрута;
	ПараметрыСопоставления.Номенклатура = Объект.Номенклатура;
	ПараметрыСопоставления.ВидПеревозки = Объект.гкс_ВидПеревозки;
	ПараметрыСопоставления.ТипПробы = Перечисления.гкс_НазначенияИспользованияКачества
		.ТипПробыПоНазначениюИспользованияКачества(Объект.гкс_НазначениеИспользованияКачества);
		
	Если Показатель = Неопределено Тогда
		Анализы = Объект.Анализы.Выгрузить(, "ПоказательАнализа");
		ПараметрыСопоставления.Показатели = Анализы.ВыгрузитьКолонку("ПоказательАнализа")
	Иначе
		ПараметрыСопоставления.Показатели = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Показатель);
	КонецЕсли;
		
	СопоставлениеПоказателей = МенеджерРегистра.СопоставлениеПоказателейПоПараметрам(ПараметрыСопоставления);
	Для Каждого ДанныеСопоставления Из СопоставлениеПоказателей Цикл
		
		Отбор = Новый Структура("ПоказательАнализа", ДанныеСопоставления.ПоказательАнализа);
		СтрокиОтбора = Объект.Анализы.НайтиСтроки(Отбор);
		Для Каждого СтрокаОтбора Из СтрокиОтбора Цикл
			СтрокаОтбора.НетСопоставленияЛИМС = ДанныеСопоставления.НетСопоставленияЛИМС;
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДекорацииОтсутствияСопоставленияЛИМС()
	
	ТекущиеДанные = Элементы.Анализы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ДекорацияОтсутствиеСопоставленияЛИМС.Видимость = Ложь;
	Иначе
		Элементы.ДекорацияОтсутствиеСопоставленияЛИМС.Видимость = ТекущиеДанные.НетСопоставленияЛИМС;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
